app/views/collections/_form.html.erb

SELECT "albums".* FROM "albums" INNER JOIN "collection_albums" ON "albums"."id" = "collection_albums"."album_id" WHERE "collection_albums"."collection_id" = 1
SELECT COUNT(*) FROM "albums" INNER JOIN "collection_albums" ON "albums"."id" = "collection_albums"."album_id" WHERE "collection_albums"."collection_id" = 1
---

<% unless @collection.albums.empty? %>

SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = 2 LIMIT 1
SELECT COUNT(*) FROM "photos" WHERE "photos"."album_id" = 1
---

<% if album.photos.empty? %>

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 2 LIMIT 1
---
<% else %>
<%= image_tag album.photos.first.file.album.url, :alt => album.title %>