app/views/collections/index.html.erb

		<h3><%= link_to collection.title, collection %></h3>
		<%= link_to (image_tag collection.albums.find(:first).photos.first.file.collection.url ), collection_path(collection) unless collection.albums.empty? || collection.albums.find(:first).photos.empty? %>
---
SELECT "albums".* FROM "albums" INNER JOIN "collection_albums" ON "albums"."id" = "collection_albums"."album_id" WHERE "collection_albums"."collection_id" = 1 LIMIT 1
SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = 2 LIMIT 1
SELECT COUNT(*) FROM "albums" INNER JOIN "collection_albums" ON "albums"."id" = "collection_albums"."album_id" WHERE "collection_albums"."collection_id" = 1
SELECT COUNT(*) FROM "photos" WHERE "photos"."album_id" = 1