app/views/collections/show.html.erb

SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT 1  [["id", "2-guadeloupe"]]
---
  <div class="image">
	<%= render :partial => "photos/thumb", :collection => album.photos.find(:all, :limit => 5, :offset => 1), :as => :photo %>