app/views/albums/_form.html.erb

SELECT "tags".* FROM "tags"
---
<%= form.label :tags %><br />
<%= form.text_field :tags, { :autocomplete => "off", :class => 'tag_list', :value => (@album.tags.map{|tag|tag.title}.join(" ") unless @album.tags.nil?) } %><br />

SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = 2
SELECT COUNT(*) FROM "photos" WHERE "photos"."album_id" = 2
---
<br />
Contains: <%= @album.photos.count %> photos<br/>