app/views/albums/show.html.erb

	<% count = 0.0 %>
	<% for photo in @album.photos.find(:all, :order => "Id ASC") %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = 1 ORDER BY Id ASC

  	<% if count == 1 || ( (count-1) / 4.0 == ( (count-1) / 4.0).to_i ) %><tr><% end %>
	<td><%= link_to image_tag( photo.file.preview.url ), [@album.collections.first, @album, photo] %></td>
---
SELECT "collections".* FROM "collections" INNER JOIN "collection_albums" ON "collections"."id" = "collection_albums"."collection_id" WHERE "collection_albums"."album_id" = 1 ORDER BY title


<% unless @album.collections.empty? %>
---
SELECT COUNT(*) FROM "collections" INNER JOIN "collection_albums" ON "collections"."id" = "collection_albums"."collection_id" WHERE "collection_albums"."album_id" = 1