app/controllers/calendars_controller.rb

SELECT "calendars".* FROM "calendars"
SELECT "events".* FROM "events"
---
  def index
    @calendars = Calendar.all
    @events = Event.all