app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = 3 ORDER BY "carts"."id" DESC LIMIT 1
---
  def index
    @carts = current_user.carts.last