app/controllers/collections_controller.rb

  def show
    @collection = Collection.find( params[:id] )
    @albums = @collection.albums.find(:all, :order => 'title')
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT 1  [["id", "1-my-gallery"]]
SELECT "albums".* FROM "albums" INNER JOIN "collection_albums" ON "albums"."id" = "collection_albums"."album_id" WHERE "collection_albums"."collection_id" = 1 ORDER BY title

  def create
    @collection = Collection.new(params[:collection])
    if @collection.save
---
INSERT INTO "collections" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 26 Aug 2014 13:21:28 UTC +00:00], ["description", "My Photo Gallery"], ["title", "My Gallery"], ["updated_at", Tue, 26 Aug 2014 13:21:28 UTC +00:00]]

  def edit
    @collection = Collection.find( params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT 1  [["id", "1-my-gallery"]]

  def update
    @collection = Collection.find( params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT 1  [["id", "1-my-gallery"]]

  def destroy
    @collection = Collection.find( params[:id])
    if @collection.destroy
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT 1  [["id", "1-my-gallery"]]
DELETE FROM "collections" WHERE "collections"."id" = $1  [["id", 1]]