app/controllers/payments_controller.rb

SELECT "payments".* FROM "payments"
---
  def index
    @payments = Payment.all

SELECT "payments".* FROM "payments" WHERE "payments"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @payment = Payment.find(params[:id])

INSERT INTO "payments" ("card_cvc", "card_month", "card_number", "card_type", "card_year", "created_at", "last_name", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @payment = Payment.new(params[:payment])
    respond_to do |format|
      if (params[:card_number].blank? || params[:card_month].blank? || params[:card_year].blank? || params[:card_cvc].blank? || params[:card_type].blank? || params[:name].blank? || params[:last_name].blank?)
        credit_card = ActiveMerchant::Billing::CreditCard.new(
          :type                => 'visa',
          :number              => "4111111111111111",
          :month               => 12,
          :year                => 2015,
          :first_name          => "test",
          :last_name           => "test",
          :verification_value  => 123
        )
      else
        credit_card = ActiveMerchant::Billing::CreditCard.new(
          :type                => params[:card_type],
          :number              => params[:card_number],
          :month               => params[:card_month].to_i,
          :year                => params[:card_year].to_i,
          :first_name          => params[:name],
          :last_name           => params[:last_name],
          :verification_value  => params[:card_cvc].to_i
        )

        if price > 0 && credit_card.valid?
          #api call
        end
      end
      if @payment.save