app/controllers/photo_carts_controller.rb

  def index
    @photo_carts = PhotoCart.all
---
SELECT "photo_carts".* FROM "photo_carts"

  def create
    if current_cart.photos
    if current_cart.photos << Photo.find(params[:photo_id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "8"]]

    def remove_from_cart
      current_cart.photo_carts.where(photo_id: params[:photo_id]).delete_all
---
DELETE FROM "photo_carts" WHERE "photo_carts"."cart_id" = 4 AND "photo_carts"."photo_id" = 2

  def destroy
    current_cart.photo_carts.where(photo_id: params[:photo_id]).delete_all
---
DELETE FROM "photo_carts" WHERE "photo_carts"."cart_id" = 5 AND "photo_carts"."photo_id" = 8